# Introdução
Os dados que serão usados, são importados do **Kaggle**, les foram disponibilizados pelo usuário **NIDULA ELGIRIYEWITHANA**, e foi atualizado pela última vez em 30 de setembro de 2023. Serão com eles que iremos inicialmente ver a distribuição de riqueza por tipo industria e sexo.
### Metodologia
Não terá metodologia definida, pois, será de acordo com o andamento e questionamentos que surgirão.

### Importando bibliotecas
Primeiramente devemos importar as bibliotecas que iremos usar, como o pandas que usaremos para ler e manipular os dados.

In [2]:
import pandas as pd

### Iendo o arquivo
Depois de importar o pandas fazemos a leitura do arquivo Billionaires Statistics Dataset.csv

In [3]:
df = pd.read_csv('Billionaires Statistics Dataset.csv')

### Impressão dos dados
Imprimiremos as primeiros 5 linhas, assim dando uma analize inicial dos dados.

In [4]:
df.head()

,rank,finalWorth,category,personName,age,country,city,source,industries,countryOfCitizenship,...,cpi_change_country,gdp_country,gross_tertiary_education_enrollment,gross_primary_education_enrollment_country,life_expectancy_country,tax_revenue_country_country,total_tax_rate_country,population_country,latitude_country,longitude_country
0,1,211000,Fashion & Retail,Bernard Arnault & family,74.0,France,Paris,LVMH,Fashion & Retail,France,...,1.1,"$2,715,518,274,227",65.6,102.5,82.5,24.2,60.7,67059887.0,46.227638,2.213749
1,2,180000,Automotive,Elon Musk,51.0,United States,Austin,"Tesla, SpaceX",Automotive,United States,...,7.5,"$21,427,700,000,000",88.2,101.8,78.5,9.6,36.6,328239523.0,37.090240,-95.712891
2,3,114000,Technology,Jeff Bezos,59.0,United States,Medina,Amazon,Technology,United States,...,7.5,"$21,427,700,000,000",88.2,101.8,78.5,9.6,36.6,328239523.0,37.090240,-95.712891
3,4,107000,Technology,Larry Ellison,78.0,United States,Lanai,Oracle,Technology,United States,...,7.5,"$21,427,700,000,000",88.2,101.8,78.5,9.6,36.6,328239523.0,37.090240,-95.712891
4,5,106000,Finance & Investments,Warren Buffett,92.0,United States,Omaha,Berkshire Hathaway,Finance & Investments,United States,...,7.5,"$21,427,700,000,000",88.2,101.8,78.5,9.6,36.6,328239523.0,37.090240,-95.712891

### Visão geral
Olhando pela primeira vez pode-se notar que a quantidade total de colunas não pode ser vista devido a quantidade, tendo isso em vista, iremos ver a quantidade total de colunas e linhas, e o nome das colunas.

In [5]:
print('Quantidade de colunas:\t',df.shape[1],'\nQuantidade de linhas:\t',df.shape[0])

Quantidade de colunas:	 35
Quantidade de linhas:	 2640

In [6]:
df.columns

Index(['rank', 'finalWorth', 'category', 'personName', 'age', 'country',
       'city', 'source', 'industries', 'countryOfCitizenship', 'organization',
       'selfMade', 'status', 'gender', 'birthDate', 'lastName', 'firstName',
       'title', 'date', 'state', 'residenceStateRegion', 'birthYear',
       'birthMonth', 'birthDay', 'cpi_country', 'cpi_change_country',
       'gdp_country', 'gross_tertiary_education_enrollment',
       'gross_primary_education_enrollment_country', 'life_expectancy_country',
       'tax_revenue_country_country', 'total_tax_rate_country',
       'population_country', 'latitude_country', 'longitude_country'],
      dtype='object')

### Simplificando o Data Frame
Para responder a nossa questão inicial não precisamos de algumas colunas como: 'latitude_country', 'longitude_country', pois, elas indicam longitude e latitude, Alem de outras colunas que não usaremos inicialmente. Essa simplificação sera chamada **df_simple**. 

Para fazer isso seguiremos os seguintes passos:
- Selecionar as colunas que queremos
- Passar essa seleção para variável nova

In [18]:
df_simple = df[['rank','category', 'personName', 'age', 'country','source', 'status','gender','finalWorth']]

### Significado das colunas
- **rank**: A classificação dos bilionários em termos de riqueza.
- **category**: A categoria ou sector em que a empresa do bilionário opera.
- **personName**: O nome completo do bilionário.
- **age**: A era do bilionário.
- **country**: O país em que o bilionário reside.
- **source**: A origem da riqueza do bilionário.
- **status**: O "D" representa os bilionários que se fizeram a si próprios (fundadores/empresários) e o "U" indica a riqueza herdada ou não adquirida.
- **gender**: O género do bilionário.
- **finalWorth**: O património líquido final do bilionário em dólares americanos.

### Impressão da simplificação

In [19]:
df_simple

,rank,category,personName,age,country,source,status,gender,finalWorth
0,1,Fashion & Retail,Bernard Arnault & family,74.0,France,LVMH,U,M,211000
1,2,Automotive,Elon Musk,51.0,United States,"Tesla, SpaceX",D,M,180000
2,3,Technology,Jeff Bezos,59.0,United States,Amazon,D,M,114000
3,4,Technology,Larry Ellison,78.0,United States,Oracle,U,M,107000
4,5,Finance & Investments,Warren Buffett,92.0,United States,Berkshire Hathaway,D,M,106000
...,...,...,...,...,...,...,...,...,...
2635,2540,Healthcare,Yu Rong,51.0,China,Health clinics,D,M,1000
2636,2540,Food & Beverage,"Richard Yuengling, Jr.",80.0,United States,Beer,E,M,1000
2637,2540,Manufacturing,Zhang Gongyun,60.0,China,Tyre manufacturing machinery,R,M,1000
2638,2540,Real Estate,Zhang Guiping & family,71.0,China,Real estate,D,M,1000
2639,2540,Diversified,Inigo Zobel,66.0,Philippines,Diversified,R,M,1000

### Comparação dos dados
Comparação dos dois data frames, comparando o numero de colunas e linhas.

In [22]:
print('Sem simplificação','\nColunas:\t',df.shape[1],'\nLinhas:\t\t',df.shape[0],'\n',
      '\nCom simplificação','\nColunas:\t',df_simple.shape[1],'\nLinhas:\t\t',df_simple.shape[0])
print('\nDiferença:\t',(df.shape[1] - df_simple.shape[1]))

Sem simplificação
Colunas:	 35
Linhas:		 2640

Com simplificação
Colunas:	 9
Linhas:		 2640

Diferença:	 26

### Descrição dos dados
Será usado a função describe, ela tem a função de mostrar informações usando os dados numéricos.

In [23]:
df_simple.describe()

              rank          age     finalWorth
count  2640.000000  2575.000000    2640.000000
mean   1289.159091    65.140194    4623.787879
std     739.693726    13.258098    9834.240939
min       1.000000    18.000000    1000.000000
25%     659.000000    56.000000    1500.000000
50%    1312.000000    65.000000    2300.000000
75%    1905.000000    75.000000    4200.000000
max    2540.000000   101.000000  211000.000000

**Significado da descrição:**
- **count**: Fas soma das quantidade dos valores, porem, não conta valores nulos. 
- **mean**: É a medía dos valores.
- **std**: É o desvio padrão.
- **min**: O valor minimo existente.
- **25%**: É o valor que esta no meio entre o valor minimo e a mediana
- **50%**: É a mediana, ou seja, o valor que esta no meio entre a duas estremidades
- **75%**: É o valor que esta no meio entre a mediana eo maximo
- **max**: O valor maximo.

### Imprimindo graficos
Para imprimir os gráficos precisamos primeiramente importar a biblioteca matplotlib, após sua importação, começaremos imprimindo gráficos para todas as colunas. Além da biblioteca dos gráficos será usado a biblioteca numpy, que é focada em usos matemáticos.

In [27]:
import matplotlib.pyplot as plt
import numpy as np

**Impressão dos dados**